ROOM_EVENTS = {
    "Trap": [
        "Переходя в другую часть комнаты, вы не заметили на полу какую-то жижу и подскользнулись на ней.",
        "Все старое и хрупкое… вам на голову упал камень. Больно.",
        "Следуя за огоньком, вы попали в ловушку. Булыжник ударил вас в спину."
    ],
    "Buff": {
        "Health": [
            "Вы нашли медальон и почувствовали прилив сил.",
            "Вы нашли мешок провизии и подкрепились.",
            "Умывшись в фонтане, вы почувствовали себя лучше."
        ],
        "Attack": [
            "Вы нашли новый меч — теперь врагов рубить легче.",
            "Вы заменили рукоятку меча на более удобную.",
            "Вы смазали меч — теперь он режет лучше."
        ],
        "Defense": [
            "Вы надели крепкие латы.",
            "Вы подобрали старый, но прочный щит.",
            "Вы нашли сапоги и шлем на манекене."
        ]
    },
    "Debuff": {
        "Health": [
            "Комната окутана холодом. Вы чувствуете слабость.",
            "Вы увидели останки приключенца... Это пугает.",
            "Комната полна темноты и мрака. Вам нехорошо."
        ],
        "Attack": [
            "Ваши руки дрожат… сложно держать оружие.",
            "У вас кружится голова. Кажется, удары будут слабее.",
            "Вы сомневаетесь в себе. Ваша атака страдает."
        ],
        "Defense": [
            "Ваше снаряжение будто стало хрупким.",
            "Вы чувствуете себя незащищённым.",
            "Что-то мешает вам концентрироваться на защите."
        ]
    }
}
